---
title: "Git과  Github"
excerpt_separator: "<!--more-->"
categories:
  - 유레카프로젝트
tags:
  - 과제
---

##1. Git이란 무엇인가?
Git은 가장 일반적으로 사용되는 버전 관리 시스템(version control system)이다. Git은 파일에 대한 변경 내용을 추적하므로 수행된 작업에 대한 기록이 있으며 필요할 경우 특정 버전으로 되돌릴 수 있다. Git은 또한 협업을 더 쉽게 만들어 여러 사람의 변경 사항을 모두 하나의 소스로 병합할 수 있게 한다. 

<!--more-->

##2. Git의 특징
Git은 로컬로 실행되는 소프트웨어이다. 파일과 파일 기록이 컴퓨터에 저장된다. 또한 온라인 호스트(예: GitHub 또는 Bitbucket)를 사용하여 파일의 복사본과 해당 수정 기록을 저장할 수 있다. 변경사항을 업로드하고 다른 개발자의 변경사항을 다운로드할 수 있는 중앙 위치에 있으므로 다른 개발자와 더 쉽게 협업할 수 있다. Git은 자동으로 변경 사항을 병합할 수 있으므로 두 사람이 같은 파일의 다른 부분을 작업하고 나중에 서로의 작업을 잃지 않고 변경 사항을 병합할 수 있다. 

<!--more-->

##3. Git은 어떻게 코드의 버전 관리를 진행할까?
Git 저장소(Repository, 또는 줄여서 repo)에는 모든 프로젝트 파일과 전체 수정 기록이 포함된다. 일반 파일 폴더(예: 웹 사이트의 루트 폴더)를 가져와서 Git으로 저장소를 생성한다. 그러면 변경 사항을 추적하기 위한 모든 Git 메타데이터가 포함된 .git 하위 폴더가 생성된다. 이렇게 저희 개인 컴퓨터에 만든 Git Repo를 Local Repository라고 한다.
macOS와 같은 유닉스 기반 운영 체제에서는 마침표(.)로 시작하는 파일 및 폴더가 숨겨져 있으므로 숨겨진 파일을 표시하지 않으면 macOS Finder에 .git 폴더가 표시되지 않는지만 일부 코드편집기를 통하여 볼 수 있다.

'''bash
git init #Git 저장소 생성
'''
